In [22]:

import os

# Replace 'new_directory_path' with the path of the directory you want to set as the working directory
new_directory_path = r'C:\Users\marcu\OneDrive\Desktop\FIT3164\Project Files\fit3164_ds16\Datasets'

# Change the working directory
os.chdir(new_directory_path)

In [17]:
import pandas as pd

# Replace 'your_file.xls' with the actual path to your Excel file
excel_file_path = 'Coles_v_Woolworths_Price_Comparison.xlsx'

# Read the Excel file into a pandas DataFrame
df = pd.read_excel(excel_file_path)

# Now you can work with the DataFrame 'df'

In [19]:
df.head()

         DATE                     ITEM_NAME  COLES_PRICE  WOOLWORTHS_PRICE
0  17.09.2019            wonder white bread          3.2               3.4
1  17.09.2019  wonder white vitaamins bread          3.5               3.4
2  17.09.2019         waterthins crispbread          4.0               3.5
3  17.09.2019          vitastics breadrolls          3.4               3.3
4  17.09.2019         tiptop sunblast white          2.9               3.0

In [71]:
import pandas as pd

# Replace 'your_file.xls' with the actual path to your Excel file
excel_file_path = 'Average_Retail_Prices_June_2011.xls'

# Read the Excel file into a pandas DataFrame
df2 = pd.read_excel(excel_file_path, 'Table_1')

# Delete the first three rows
df2 = df2.iloc[3:]

# Reset the index of the DataFrame
df2.reset_index(drop=True, inplace=True)

# Set the values from the first row as column names
df2.columns = df2.iloc[0]

# Drop the first row (used as column names)
df2 = df2[2:]

# Reset the index of the DataFrame
df2.reset_index(drop=True, inplace=True)
# Delete the last three rows
df2 = df2.iloc[:-3]

# Reset the index of the DataFrame
df2.reset_index(drop=True, inplace=True)

In [72]:
df2['Month'] = 'June'

df2['Year'] = '2011'

print(df2)

0                                               Items Sydney Melbourne  \
0                                      Dairy products    NaN       NaN
1                              Milk, 2 ltr whole milk    306       286
2                           Cheese, sliced (500g pkt)    527       588
3                                       Butter (500g)    436       371
4                           Bread and Cereal products    NaN       NaN
..                                                ...    ...       ...
60  Draught beer, low alcohol, public bar (285ml g...    302       312
61  Draught beer, full strength, public bar (285ml...    342       392
62                      Scotch, public bar (30ml nip)    523       640
63                             Personal care products    NaN       NaN
64                           Toilet soap (2 bar pack)    401       424

0  Brisbane Adelaide Perth Hobart Darwin Canberra Month  Year
0       NaN      NaN   NaN    NaN    NaN      NaN  June  2011
1       256      242   236    324    325      256  June  2011
2       515      557   552    534    633      594  June  2011
3       360      364   394    356    431      438  June  2011
4       NaN      NaN   NaN    NaN    NaN      NaN  June  2011
..      ...      ...   ...    ...    ...      ...   ...   ...
60      312      388   376    331    296      299  June  2011
61      341      430   394    383    391      333  June  2011
62      526      592   636    492    515      496  June  2011
63      NaN      NaN   NaN    NaN    NaN      NaN  June  2011
64      416      387   393    413    430      396  June  2011

[65 rows x 11 columns]

In [6]:
import os
import pandas as pd

# Replace 'folder_path' with the path to your folder containing the files
folder_path = r'C:\Users\marcu\OneDrive\Desktop\FIT3164\Project Files\fit3164_ds16\Datasets\Average Retail Prices 2000-2011'

# Get a list of all files in the folder
file_list = os.listdir(folder_path)

# Initialize an empty list to store DataFrames
dfs = []

# Iterate through each file and read it into a DataFrame
for file in file_list:
    if file.endswith('.pdf'):
        file_path = os.path.join(folder_path, file)
        #Need to do for PDF
        year, month = file.split('-')
        df['Year'] = year
        df['Month'] = month
        dfs.append(df)
    if file.endswith('.xls'):  # Change the file extension if needed
        file_path = os.path.join(folder_path, file)
        df = pd.read_excel(file_path, sheet_name='Table_1')  # Assuming 'Table_1' is the sheet name
        year, month = file.split('-')
        df['Year'] = year
        df['Month'] = month
        dfs.append(df)

# Concatenate all DataFrames in the list
combined_df = pd.concat(dfs, ignore_index=True)

# Display the combined DataFrame
combined_df.head(-20)

,Australian Bureau of Statistics,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Year,Month
0,Cat. No. 6403.0.55.001 Average Retail Prices o...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2004,12.xls
1,December Quarter 2004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2004,12.xls
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2004,12.xls
3,NaN,NaN,NaN,Prices in cents,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2004,12.xls
4,NaN,NaN,NaN,Sydney,Melbourne,Brisbane,Adelaide,Perth,Hobart,Darwin,Canberra,2004,12.xls
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2136,"Jam, strawberry (500g jar)",335,331,333,311,335,331,354,344,NaN,NaN,2011,06.xls
2137,Teabags (180g pkt),405,397,406,363,421,400,391,410,NaN,NaN,2011,06.xls
2138,"Coffee, instant (150g jar)",706,733,697,696,721,698,738,737,NaN,NaN,2011,06.xls
2139,Tomato sauce (600ml bottle),204,226,226,237,206,229,235,212,NaN,NaN,2011,06.xls
2140,"Margarine, poly-unsaturated (500g)",319,307,311,308,306,310,323,318,NaN,NaN,2011,06.xls